creator = 441399484
times = ['Время до линейки', 'Линейка', 'Завтрак', 'Время после завтрака', 'Обед', 'Время после обеда', 'Ужин',
         'Время после ужина (вечер)', 'Ночь']

rp_players = [creator, 652585389, 737959649, 638721729, 438090820]
yestexts = ['хорошо, ольга дмитриевна!', 'хорошо!', 'я этим займусь!', 'я готов!', 'я готова!']
notexts = ['простите, но у меня уже появились дела.']

botadmins = [creator]
el_admins = []  # [574865060, 524034660]
al_admins = []  # [512006137, 737959649]
ul_admins = []  # [851513241]
mi_admins = []  # [268486177]
le_admins = []  # [60727377, 851513241]
sl_admins = []  # [851513241]
od_admins = []  # [629070350, 512006137, 850666493]
zh_admins = []  # [390362465]
to_admins = []  # [414374606]
sh_admins = []  # [574865060]
se_admins = []  # [851513241, 737959649]
pi_admins = []  # [512006137]

mainchat = -1001351496983

rpchats = []

accept = []
decline = []

nowrp = False

neiro_on = False

ignorelist = []

rds = True

works = [
    {'name': 'concertready',
     'value': 0,
     'lvl': 1
     },
    {'name': 'sortmedicaments',
     'value': 0,
     'lvl': 2
     },
    {'name': 'checkpionerssleeping',
     'value': 0,
     'lvl': 1
     },

    {'name': 'pickberrys',
     'value': 0,
     'lvl': 2
     },
    {'name': 'bringfoodtokitchen',
     'value': 0,
     'lvl': 2
     },
    {'name': 'helpinmedpunkt',
     'value': 0,
     'lvl': 1
     },
    {'name': 'helpinkitchen',
     'value': 0,
     'lvl': 2
     },

    {'name': 'cleanterritory',
     'value': 0,
     'lvl': 3
     },
    {'name': 'washgenda',
     'value': 0,
     'lvl': 3
     }
]

worktexts = ['Ну что, пионер, скучаешь? Ничего, сейчас найду для тебя подходящее занятие! Подожди немного.',
             'Бездельничаешь? Сейчас я это исправлю! Подожди пару минут, найду тебе занятие.',
             'Здравствуй, пионер! Сейчас найду, чем тебя занять.']

worldtexts = [', чтобы знать, что происходит в лагере (в том числе и с вами), советую отписаться мне в личку.'
              ' Можете считать меня своим внутренним голосом, потому что забивать себе голову тем, кто я на самом деле,'
              ' не имеет смысла... Но а теперь к делу.\n\n',
              ', отпишись, пожалуйста, мне в личку. Ведь правильнее будет, если твоя личная информация будет оставаться'
              ' при тебе, а не оглашаться на весь лагерь. Ладно, ближе к делу...\n\n']
